Revit 2027 API
Viewport.SheetId Property
 The element id of the ViewSheet on which the viewport appears, or InvalidElementId if this viewport does not associate a view with placement onto a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SheetId { get; }
Public ReadOnly Property SheetId As ElementId
	Get
public:
property ElementId^ SheetId {
	ElementId^ get ();
}
member SheetId : ElementId with get
Property Value
ElementId
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace